from flask import Flask, request, render_template, make_response
from parse import *
import random

app = Flask(__name__)
dic = {'Ь':'', 'ь':'', 'Ъ':'', 'ъ':'', 'А':'A', 'а':'a', 'Б':'B', 'б':'b', 'В':'V', 'в':'v',
       'Г':'G', 'г':'g', 'Д':'D', 'д':'d', 'Е':'E', 'е':'e', 'Ё':'Yo', 'ё':'yo', 'Ж':'Zh', 'ж':'g',
       'З':'Z', 'з':'z', 'И':'I', 'и':'i', 'Й':'Y', 'й':'y', 'К':'K', 'к':'k', 'Л':'L', 'л':'l',
       'М':'M', 'м':'m', 'Н':'N', 'н':'n', 'О':'O', 'о':'o', 'П':'P', 'п':'p', 'Р':'R', 'р':'r',
       'С':'S', 'с':'s', 'Т':'T', 'т':'t', 'У':'U', 'у':'u', 'Ф':'F', 'ф':'f', 'Х':'H', 'х':'h',
       'Ц':'Ts', 'ц':'ts', 'Ч':'Ch', 'ч':'ch', 'Ш':'Sh', 'ш':'sh', 'Щ':'Sch', 'щ':'sch', 'Ы':'Yi',
       'ы':'yi', 'Э':'E', 'э':'e', 'Ю':'Yu', 'ю':'yu', 'Я':'Ya', 'я':'ya', '_': '_', '-': '-'}

region_dic = {"Республика Адыгея": 1, "Республика Алтай": 4, "Республика Башкортостан": 2,
              "Республика Бурятия": 3, "Республика Дагестан": 5, "Республика Ингушетия": 6,
              "Кабардино-Балкарская Республика": 7, "Республика Калмыкия": 8, "Карачаево-Черкесская Республика": 9,
              "Республика Карелия": 10, "Республика Коми": 11, "Республика Крым": 82, "Республика Марий Эл": 12,
              "Республика Мордовия": 13, "Республика Саха (Якутия)": 14, "Республика Северная Осетия — Алания": 15,
              "Республика Татарстан": 16, "Республика Тыва": 17, "Удмуртская Республика": 18, "Республика Хакасия": 19,
              "Чеченская Республика": 95, "Чувашская Республика": 21, "Алтайский край": 22, "Забайкальский край": 75,
              "Камчатский край": 41, "Краснодарский край": 23, "Красноярский край": 24, "Пермский край": 59,
              "Приморский край": 25, "Ставропольский край": 26, "Хабаровский край": 27, "Амурская область": 28,
              "Архангельская область": 29, "Астраханская область": 30, "Белгородская область": 31,
              "Брянская область": 32, "Владимирская область": 33, "Волгоградская область": 34,
              "Вологодская область": 35, "Воронежская область": 36, "Ивановская область": 37, "Иркутская область": 38,
              "Калининградская область": 39, "Калужская область": 40, "Кемеровская область": 42,
              "Кировская область": 43, "Костромская область": 44, "Курганская область": 45, "Курская область": 46,
              "Ленинградская область": 47, "Липецкая область": 48, "Магаданская область": 49, "Московская область": 50,
              "Мурманская область": 51, "Нижегородская область": 52, "Новгородская область": 53,
              "Новосибирская область": 54, "Омская область": 55, "Оренбургская область": 56, "Орловская область": 57,
              "Пензенская область": 58, "Псковская область": 60, "Ростовская область": 61, "Рязанская область": 62,
              "Самарская область": 63, "Саратовская область": 64, "Сахалинская область": 65, "Свердловская область": 66,
              "Смоленская область": 67, "Тамбовская область": 68, "Тверская область": 69, "Томская область": 70,
              "Тульская область": 71, "Тюменская область": 72, "Ульяновская область": 73, "Челябинская область": 74,
              "Ярославская область": 76, "Москва": 77, "Санкт-Петербург": 78}



@app.route('/cars')
def get():
    page = request.args.get('page', default='1', type=str)
    t = request.args.get('marka', default='', type=str)
    sor = request.args.get('sort', default='', type=str)
    city = request.args.get('city', default='', type=str)

    autoru_pg, drom_pg = '0', '0'


    t = t.replace(' ', '_', 1)
    if t == 'ВАЗ_(LADA)':
        t = 'vaz'
    if t.lower()[0] in dic:
        t = ''.join([dic[i] for i in t.lower()])
    if t == 'moskvich':
        t = 'moscvich'
    if t == 'Mercedes-Benz':
        t = 'mercedes'
    if t == 'SsangYong':
        t = 'ssang_yong'
    t = t.lower()

    autoru_city = city
    if 'Республика' in autoru_city:
        for i in autoru_city.split():
            if 'Республика' not in i:
                autoru_city = i
    autoru_city = '_'.join(autoru_city.split(' '))
    autoru_city = ''.join([dic[i] for i in autoru_city.lower()])
    autoru = autoru_parse(t, page, sor, autoru_city)
    drom = drom_parse(t, page, sor, region_dic[city])
    if autoru:
        autoru, autoru_pg = autoru
    if drom:
        drom, drom_pg = drom
    all_result = autoru + drom
    random.shuffle(all_result)
    if sor == 'По цене ↑':
        all_result.sort(key=lambda x: int(''.join(x['price'][:x['price'].index('₽')].split())))
    if sor == 'По цене ↓':
        all_result.sort(key=lambda x: int(''.join(x['price'][:x['price'].index('₽')].split())), reverse=True)
    # ---------------------------------------------------------------------------------------------------------------
    all_result.append((max(map(int, [autoru_pg, drom_pg])), t, sor, city))
    # ---------------------------------------------------------------------------------------------------------------
    if len(all_result) > 1:
        return render_template('temp.html', cars=all_result)
    else:
        return render_template('temp.html', cars=[{
                    'title': 'По вашему запросу ничего не найдено',
                    'link': '',
                    'photo': '',
                    'year': '',
                    'km': '',
                    'motor': '',
                    'price': ''
                }])


@app.route('/')
def main():
    return render_template('index.html')


@app.route('/about')
def about():
    return render_template('about.html')


if __name__ == '__main__':
    app.run()